## [Цикл for](https://practicum.yandex.ru/learn/data-scientist/courses/f332f1ff-8036-4f31-ad9c-866410873a45/sprints/43469/topics/a8f68bf8-7db9-463f-bf7e-95822cb524b8/lessons/4002cf4a-7dbb-47e9-858f-f6060697de00/)

**Цикл** — конструкция в программировании, позволяющая выполнить инструкции несколько раз.

**Заголовок цикла** — его первая строка.

**Тело цикла** — набор инструкций, которые выполняются на каждом шаге цикла.

**Итерация цикла** — одно повторение цикла.

Итак, один из видов цикла в Python — `for`. Он перебирает элементы списка и для каждого вызывает одинаковые инструкции. Например, вывод на экран:

```python
movies = ['Побег из Шоушенка', 'Крестный отец', 'Темный рыцарь', 'Список Шиндлера']

for movie in movies: #заголовок цикла

print('Название фильма:', movie) #тело цикла, в данном случае состоит из одной команды
```

*   Ключевое слово `for`.
*   Переменную-итератор. В данном случае `movie` — итератор, который перемещается по списку слева направо, принимая на каждом шаге значение очередного элемента списка.
*   Ключевое слово `in`.
*   Список, по которому движется итератор.
*   Знак `:`. Без него будет синтаксическая ошибка.

**Перебор индексов элементов списка. Функция range()

Ещё можно перебирать индексы.

Индексы списка — ряд чисел, где первое всегда `0`, а последнее число на единицу меньше длины списка. Цикл `for` идёт по числовой последовательности, которая соответствует индексам элементов.
```python
for i in range(10): # заголовок цикла

print('Сейчас выполняется шаг', i) #тело цикла в данном случае из одной команды
```

учили не называть переменные одной буквой. Но итераторы, которые перебирают числовые последовательности, часто именуются латинскими буквами `i`, `j` или `k`. 
```python
for i in range(**len**(movies)):

print('Название фильма:', movies[i])
```

! Если исходный список менять не нужно, тогда цикл с перебором элементов получится лаконичнее, чем с перебором индексов.

**Циклы и встроенные функции для обработки списков

Данные часто приходится группировать, чтобы посчитать некоторые значения для всей группы. Например, для списка чисел приходится найти:

*   Сумму и произведение.
*   Максимальное и минимальное значение.

**!!!** Переменную с результатом обязательно объявлять до запуска цикла. Если бы задача состояла в изменении исходного списка, помогла бы функция `range()`:
```python
total_duration = 0

for duration in movies_duration:

total_duration += duration

print(total_duration)
```

Произведение элементов вычисляют тем же образом, но значение счётчика меняют с `0` на `1` — чтобы на первом шаге цикла в счётчик сохранился первый элемент списка, умноженный на единицу, а не на ноль.

Другое преимущество Python — встроенные методы. Расчёт суммы и произведения встречаются в работе аналитика так часто, что для них в языке есть готовые функции.

Функция `sum()` принимает в качестве аргумента список и возвращает сумму его элементов:
```python
total_duration = sum(movies_duration)
```

Функция для расчёта произведения — `prod()`
```python
import math

mult_duration = math.prod(movies_duration)
```

**Максимум и минимум
```python
max_duration = max(movies_duration)

min_duration = min(movies_duration)
```

**Факториалы** важны в комбинаторике — разделе математики, который занимается вопросами вроде:

*   Сколько существует различных способов разложить объекты заданным образом?
*   Сколько комбинаций можно получить из заданных объектов?
```python
for i in range(1, number + 1): # в цикле перебираете индексы от 1 до number, поэтому добавляете единицу к правой границе, чтобы она была включена в диапазон

fact *= i # в теле цикла домножаете счётчик на очередное число, оно будет находиться в итераторе i, т.к. именно он перебирает значения последовательности

print(fact)
```

**ИЛИ ФАКТОРИАЛ**  
```python
print(math.factorial(8))
```

Чтобы ничего не забыть, скачайте [шпаргалку темы](https://code.s3.yandex.net/data-analyst/praktikum_data_analysis_takeaways_basicPython_theme4.pdf).